Repository: pypi-data/pypi-mirror-391
Catalog: packages/aa-contacts/aa_contacts-0.10.2-py3-none-any.whl/aa_contacts/locale/*/LC_MESSAGES/django.po
Languages: it_it

source: Contacts
it_it: Contatti

source: Character is not in an alliance
it_it: Il personaggio non è in un'alleanza

source: %(alliance)s has a token already
it_it: %(alliance)s ha già un token

source: %(corporation)s has a token already
it_it: %(corporation)s ha già un token

source: Alliance Contacts
it_it: Contatti dell'Alleanza

source: Last update
it_it: Ultimo aggiornamento

source: Actions
it_it: Azioni

source: Update
it_it: Aggiorna

source: Contact
it_it: Contatto

source: Contact Type
it_it: Tipo di Contatto

source: Labels
it_it: Etichette

source: Standing
it_it: Reputazione

source: Notes
it_it: Note

source: Corporation Contacts
it_it: Contatti della Corporazione

source: Submit
it_it: Invia

source: Alliances
it_it: Alleanze

source: View
it_it: Vai

source: No alliances available
it_it: Nessun'alleanza disponibile

source: Corporations
it_it: Corporazioni

source: No corporations available
it_it: Nessuna corporazione disponibile

source: Legacy UI
it_it: Interfaccia precedente

source: New UI
it_it: Nuova intrefaccia

source: You do not have the permissions for viewing this alliance contacts.
it_it: Non hai il permesso di vedere i contatti di quest'alleanza.

source: You do not have the permissions for viewing this corporation contacts.
it_it: Non hai il permesso di vedere i contatti di questa corporazione.

source: You need to be in an alliance to add alliance contacts.
it_it: Devi essere in un'alleanza per aggiungere contatti dell'alleanza.

source: Alliance contacts for your alliance are already being tracked.
it_it: I contatti della tua alleanza stanno già venendo tracciati.

source: Alliance contacts are now being tracked.
it_it: I contatti della tua alleanza stanno ora venendo tracciati.

source: Corporation contacts for your corporation are already being tracked.
it_it: I contatti della tua corporazione stanno già venendo tracciati.

source: Corporation contacts are now being tracked.
it_it: I contatti della tua corporazione stanno ora venendo tracciati.

source: Alliance contacts are being updated.
it_it: I contatti dell'alleanza stanno venendo aggiornati.

source: Corporation contacts are being updated.
it_it: I contatti della corporazione stanno venendo aggiornati.

source: %(contact)s contact updated successfully
it_it: Contatto di %(contact)s aggiornato con successo
