Repository: pypi-data/pypi-mirror-391
Catalog: packages/aa-contacts/aa_contacts-0.10.1-py3-none-any.whl/aa_contacts/locale/*/LC_MESSAGES/django.po
Languages: de

source: Contacts
de: Kontakte

source: Character is not in an alliance
de: Charakter ist in keiner Allianz

source: %(alliance)s has a token already
de: %(alliance)s hat bereits einen Token

source: %(corporation)s has a token already
de: %(corporation)s hat bereits einen Token

source: Alliance Contacts
de: Allianzkontakte

source: Last update
de: Letzte Aktualisierung

source: Actions
de: Aktionen

source: Update
de: Aktualisieren

source: Contact
de: Kontakt

source: Contact Type
de: Kontakttyp

source: Labels
de: Bezeichner

source: Standing
de: Ansehen

source: Notes
de: Notizen

source: Corporation Contacts
de: Corporationskontakte

source: Submit
de: Absenden

source: Alliances
de: Allianzen

source: View
de: Anschauen

source: No alliances available
de: Keine Allianzen verfügbar

source: Corporations
de: Corporationen

source: No corporations available
de: Keine Corporationen verfügbar

source: New UI
de: Neue UI

source: You do not have the permissions for viewing this alliance contacts.
de: Du hast keine Berechtigung, die Kontakte dieser Allianz einzusehen.

source: You do not have the permissions for viewing this corporation contacts.
de: Du hast keine Berechtigung, die Kontakte dieser Corporation einzusehen.

source: You need to be in an alliance to add alliance contacts.
de: Um Allianzkontakte hinzuzufügen, musst Du Mitglied einer Allianz sein.

source: Alliance contacts for your alliance are already being tracked.
de: Die Kontakte Deiner Allianz werden bereits erfasst.

source: Alliance contacts are now being tracked.
de: Die Kontakte der Allianz werden nun erfasst.

source: Corporation contacts for your corporation are already being tracked.
de: Die Kontakte Deiner Corporation werden bereits erfasst.

source: Corporation contacts are now being tracked.
de: Die Kontakte der Corporation werden nun erfasst.

source: Alliance contacts are being updated.
de: Allianzkontakte werden aktualisiert.

source: Corporation contacts are being updated.
de: Corporationskontakte werden aktualisiert.

source: %(contact)s contact updated successfully
de: %(contact)s Kontakte erfolgreich aktualisiert
