Repository: pypi-data/pypi-mirror-391
Catalog: packages/django-cms-qe/django_cms_qe-4.4.0.tar.gz/django_cms_qe-4.4.0/cms_qe/locale/*/LC_MESSAGES/django.po
Languages: cs

source: Export selected as CSV
cs: Exportovat vybrané položky jako CSV

source: Export selected as TSV (Tab-Separated Values)
cs: Exportovat vybrané položky jako TSV (Tab-Separated Values)

source: Export selected as XLS
cs: Exportovat vybrané položky jako XLS

source: Export selected as XLSX
cs: Exportovat vybrané položky jako XLSX

source: Export selected as ODS
cs: Exportovat vybrané položky jako ODS

source: Export selected as JSON
cs: Exportovat vybrané položky jako JSON

source: Export selected as YAML
cs: Exportovat vybrané položky jako YAML

source: Export selected as HTML
cs: Exportovat vybrané položky jako HTML

source: Export selected as LATEX (LaTeX Source Document)
cs: Exportovat vybrané položky jako LATEX (LaTeX Source Document)

source: Export selected as RST (reStructuredText)
cs: Exportovat vybrané položky jako RST (reStructuredText)

source: Generic error
cs: Obecná chyba

source: You see this page because you didn't configured error page yet. Please add new page with slug <span class="label label-primary">%(slug)s</span>.
cs: Vidíte tuto stránku, protože není nakonfigurovaná chybová stránka. Prosím,přidejte novou stránku se slugem <span class="label label-primry">%(slug)s</span>.

source: List
cs: Seznam

source: Gallery
cs: Galerie

source: Container
cs: Kontejner

source: Fluid container
cs: Plovoucí kontejner

source: For example:
cs: Například:

source: Full container
cs: Plný kontejner

source: English
cs: Angličtina

source: Czech
cs: Čeština

source: You see this page because you didn't configured error page yet. Please add new page with slug <strong>%(slug)s</strong>.
cs: Vidíte tuto stránku, protože není nakonfigurovaná chybová stránka. Prosím,přidejte novou stránku se slugem <strong>%(slug)s</strong>.

source: Internal error
cs: Obecná chyba

source: Something went very wrong. Please try again later.
cs: Něco se nezdařilo. Prosím, zkuste to později.

source: To log into the API, the user needs to have the access permission assigned. To access other records in the API, the user must have the VIEW permission set for the model.
cs: Pro přihlášení do API je potřeba, aby uživatel měl přiděleno oprávnění ACCESS. Pro přístup k dalším záznamům v API je nutné, aby uživatel měl nastaveno oprávnění VIEW pro daný model.

source: Temporarily unavailable content
cs: Dočasně nedostupný obsah

source: This page is temporarily unavailable.
cs: Tato stránka je dočasně nedostupná.

source: Please try again later.
cs: Prosím, zkuste to později.

source: Thank you for your understanding.
cs: Děkujeme za pochopení.
